/* No comment provided by engineer. */
"A new beta version of File Juicer is available" = "En ny Beta-version av File Juicer finns tillgänglig";

/* No comment provided by engineer. */
"A new version of File Juicer is available" = "En nyare version av File Juicer finns tillgänglig";

/* No comment provided by engineer. */
"Cancel" = "Avbryt";

/* As in choose folder */
"Choose" = "Välj";

/* No comment provided by engineer. */
"Choose Folder" = "Välj mapp…";

/* No comment provided by engineer. */
"Could not save a found file. Check for disk space, and where the file is set to be saved in the preferences" = "Kunde inte spara filen. Kontrollera ditt diskutrymme och var du ställt in att filen skall sparas i inställningarna.";

/* As in generating thumbnails */
"Generating:" = "Skapar:";

/* No comment provided by engineer. */
"Go to Download Page" = "Gå till nedladdningssidan";

/* No comment provided by engineer. */
"Juicing:" = "Gör jos utav";

/* When registration number check fails */
"License number is not valid!" = "Gå till nedladdningssidan";

/* No comment provided by engineer. */
"No information about a new version is available!" = "Det finns ingen information om någon nyare version!";

/* No comment provided by engineer. */
"OK" = "OK";

/* skip generating thumbnails */
"Skip" = "Hoppa över";

/* No comment provided by engineer. */
"Stop" = "Avbryt";

/* When registration succeeded */
"Thank You" = "Tack!";
"Thank You!\nPortable Version Registered" = "Tack skall du ha!\nPortabel Version Registrerad";

/* As in generating thumbnails */
"thumbnails" = "miniatyrer";

/* Of File Juicer */
"You have the newest version!" = "Du har den senaste versionen";

/* For File Juicer */
"Paid..." = "Betald...";

/* For the image in the main window (I'll put it in a pdf later) */
"Drag files here" = "Dra filer hit";

/* For flash card juicing */
"No Flash Cards/Disks Found!" = "Inga Flash-kort eller diskar funna!";

/* When registration code or name does not match */
"RegistrationFailed" = "Registreringsinformationen du har angivit är inte giltig. Vänligen kontrollera att \"registered to\" och \"registration number\" är inskrivna exakt som det står i din registreringsinformation.";

/* The menu item */
"Registration..." = "Registrering…";

"Watermark Reminder" = "File Juicer är Shareware.\nDet fungerar fullt ut, men visar påminnelser och skapar vattenstämplar tills du registrerar.";

"FileJuicer is fully functional for %i days to let you try before you buy, but with watermarks in some images.\n" = "FileJuicer fungerar fullt ut i %i dagar så du kan testa innan du köper det, men det vattenstämplar vissa bilder.\n";
"The FileJuicer trial period has expired. JPEG and GIF will still get extracted but with watermarks in some images.\n" = "FileJuicers prövotid har gått ut. JPEG och GIF kommer att extraheras men med en vattenstämpel i vissa bilder.\n";
/* When registration code or name does not match */
"Your entry is too long." = "Det inmatade är för långt.";

/* dropping files */
"File too large" = "Filen är för stor";

/* If you want to convert WMV files you need a codec for QuickTime */
"If you want to convert WMV files you need a codec for QuickTime" = "Om du vill konvertera WMV-filer så behöver du en codec för QuickTime";

/* If you want to convert WMV files you need a codec for QuickTime */
"Get Codec" = "Hämta Codec";

/* For the File Menu */
"iPod Thumbs" = "iPod tumnaglar";
"iPod Photo Cache" = "iPod Photo Cache";
"JPEG Thumbs" = "JPEG tumnaglar";
"64 x 64 Thumbs" = "64 x 64 tumnaglar";
"32 x 32 Thumbs" = "32 x 32 tumnaglar";
"iPhone and iPod Touch Backups" = "iPhone and iPod Touch Backups";
"iTunes Album Artwork Cache" = "iTunes Album Artwork Cache";
/* Generating Index files */
"Index" = "Index";